In [2]:
import pandas as pd
file_path = r"C:\Users\Dell\Desktop\customer.csv.xlsx"
df = pd.read_excel(file_path)
df.head()

   CustomerID  Age  Annual Income($)\t  Spending Score\t  Gender
0           1   57               22745                69    Male
1           2   44               45049                55  Female
2           3   49               48573                65    Male
3           4   46               30215                53  Female
4           5   47               88475                44  Female

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   CustomerID         10 non-null     int64
 1   Age                10 non-null     int64
 2   Annual Income($)	  10 non-null     int64
 3   Spending Score	    10 non-null     int64
 4   Gender             10 non-null     object
dtypes: int64(4), object(1)
memory usage: 528.0+ bytes

In [4]:
df.head

<bound method NDFrame.head of    CustomerID  Age  Annual Income($)\t  Spending Score\t  Gender
0           1   57               22745                69    Male
1           2   44               45049                55  Female
2           3   49               48573                65    Male
3           4   46               30215                53  Female
4           5   47               88475                44  Female
5           6   37               44714                71    Male
6           7   59               64661                64    Male
7           8   30               91199                62  Female
8           9   51               88109                74    Male
9          10   36               40737                69    Male>

In [5]:
df.tail

<bound method NDFrame.tail of    CustomerID  Age  Annual Income($)\t  Spending Score\t  Gender
0           1   57               22745                69    Male
1           2   44               45049                55  Female
2           3   49               48573                65    Male
3           4   46               30215                53  Female
4           5   47               88475                44  Female
5           6   37               44714                71    Male
6           7   59               64661                64    Male
7           8   30               91199                62  Female
8           9   51               88109                74    Male
9          10   36               40737                69    Male>

In [6]:
df.describe()

       CustomerID        Age  Annual Income($)\t  Spending Score\t
count    10.00000  10.000000           10.000000         10.000000
mean      5.50000  45.600000        56447.700000         62.600000
std       3.02765   9.215928        25174.437255          9.347608
min       1.00000  30.000000        22745.000000         44.000000
25%       3.25000  38.750000        41731.250000         56.750000
50%       5.50000  46.500000        46811.000000         64.500000
75%       7.75000  50.500000        82247.000000         69.000000
max      10.00000  59.000000        91199.000000         74.000000

In [7]:
df.Age.mean()

45.6

In [8]:
df.Age.mode()

0    30
1    36
2    37
3    44
4    46
5    47
6    49
7    51
8    57
9    59
Name: Age, dtype: int64

In [9]:
df.Age.median()

46.5

In [10]:
df.groupby(['Age']).count()

     CustomerID  Annual Income($)\t  Spending Score\t  Gender
Age
30            1                   1                 1       1
36            1                   1                 1       1
37            1                   1                 1       1
44            1                   1                 1       1
46            1                   1                 1       1
47            1                   1                 1       1
49            1                   1                 1       1
51            1                   1                 1       1
57            1                   1                 1       1
59            1                   1                 1       1

In [13]:
print(df.columns)

Index(['CustomerID', 'Age', 'Annual Income($)\t', 'Spending Score\t',
       'Gender'],
      dtype='object')

In [14]:
df[['Age' , 'Annual Income($)\t', 'Spending Score\t']].mean()

Age                      45.6
Annual Income($)\t    56447.7
Spending Score\t         62.6
dtype: float64

In [15]:
df[['Age' , 'Annual Income($)\t', 'Spending Score\t']].mode()

   Age  Annual Income($)\t  Spending Score\t
0   30               22745              69.0
1   36               30215               NaN
2   37               40737               NaN
3   44               44714               NaN
4   46               45049               NaN
5   47               48573               NaN
6   49               64661               NaN
7   51               88109               NaN
8   57               88475               NaN
9   59               91199               NaN

In [16]:
df[['Age' , 'Annual Income($)\t', 'Spending Score\t']].median()

Age                      46.5
Annual Income($)\t    46811.0
Spending Score\t         64.5
dtype: float64

In [17]:
df[['Age' , 'Annual Income($)\t', 'Spending Score\t']].max()

Age                      59
Annual Income($)\t    91199
Spending Score\t         74
dtype: int64

In [18]:
df[['Age' , 'Annual Income($)\t', 'Spending Score\t']].std()

Age                       9.215928
Annual Income($)\t    25174.437255
Spending Score\t          9.347608
dtype: float64

In [22]:
df2 = df.groupby('Gender')
df

   CustomerID  Age  Annual Income($)\t  Spending Score\t  Gender
0           1   57               22745                69    Male
1           2   44               45049                55  Female
2           3   49               48573                65    Male
3           4   46               30215                53  Female
4           5   47               88475                44  Female
5           6   37               44714                71    Male
6           7   59               64661                64    Male
7           8   30               91199                62  Female
8           9   51               88109                74    Male
9          10   36               40737                69    Male

In [23]:
for Gender, Gender_f in df2: 
    print(Gender)
    print(Gender_f)

Female
   CustomerID  Age  Annual Income($)\t  Spending Score\t  Gender
1           2   44               45049                55  Female
3           4   46               30215                53  Female
4           5   47               88475                44  Female
7           8   30               91199                62  Female
Male
   CustomerID  Age  Annual Income($)\t  Spending Score\t Gender
0           1   57               22745                69   Male
2           3   49               48573                65   Male
5           6   37               44714                71   Male
6           7   59               64661                64   Male
8           9   51               88109                74   Male
9          10   36               40737                69   Male

In [25]:
df2.get_group('Male')

   CustomerID  Age  Annual Income($)\t  Spending Score\t Gender
0           1   57               22745                69   Male
2           3   49               48573                65   Male
5           6   37               44714                71   Male
6           7   59               64661                64   Male
8           9   51               88109                74   Male
9          10   36               40737                69   Male

In [26]:
df2.get_group('Female')

   CustomerID  Age  Annual Income($)\t  Spending Score\t  Gender
1           2   44               45049                55  Female
3           4   46               30215                53  Female
4           5   47               88475                44  Female
7           8   30               91199                62  Female